org/2020-09-14-Vite_Cors_Error_On_Development_Server.org

                #+STARTUP: showall indent
                #+OPTIONS: toc:nil
                #+OPTIONS: org-export-with-smart-quotes
                #+OPTIONS: org-export-with-emphasize
                #+OPTIONS: org-export-with-timestamps
                #+BEGIN_EXPORT html
                ---
                layout: post #jekyll layout
                title: "Vite Cors Error On Development Server" #title 
                date:   2020-09-14 15:20:05 +0900                 
                ---
                #+END_EXPORT
                * vite CORS error on development server
https://vitejs.dev/config/server-options.html
: change request uri to local uri -> rewrite to external uri inside vite configs
: then request to local uri
#+begin_src javascript
  // in vite.config.ts
  import { defineConfig } from 'vite';
  import react from '@vitejs/plugin-react-swc';

  // https://vitejs.dev/config/
  export default defineConfig({
      plugins: [
          react()
      ],
      server: {
          proxy: {
              // "/api/something" --rewrite--> "http://api.github.com/something"
              '/api': {
                  target: 'http://api.github.com',
                  changeOrigin: true,
                  rewrite: (path) => path.replace(/^\/api/, ''),
                  secure: false,
                  ws: true
              }
          }
      }
  });
#+end_src

